# 2) კომენტარების სახით ახსენით რა არის input-ი და output-ი, მოიყავნეთ შესაბამისი მაგალითები.

# 3) შექმენით ცვლადი, რომელშიც შეინხავთ input ინსტრუქციით შემოტანილ მნიშვნელობას, შემდეგ შეამოწმებთ თუ რა ტიპის მონაცემი ინახება ამ ცვლადში და დაპრინტავთ.

# 4) თიოთეული მონაცემთა ტიპისთვის (str,int,float), შექმენით 5 ცვლადი და დაუწერეთ კომენტარი თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.

# 5) აიღეთ 3 ცვლადი, შეინახეთ განსხავებული მონაცემთა ტიპები (str,int,float), შემდეგ type ინსტრუქციის გამოყენებით შეამოწმეთ, თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი.

# 6) მომხმარებელს შემოატანინეთ ორი სიტყვა, შეინახეთ ისინი ცვლადებში, მოახდინეთ მათი კონკატინაცია და დაბეჭდეთ.

# 7) მომხმარებელს შემოატანინეთ 5 რიცხვი სხვადასხვა დამოუკიდებელი input-ების სახით, თქვენი დავალებაა დაბეჭდოთ მათი საშუალო არითმეტიკული.

# 8) მომხმარებელს შემოატანინეთ სახელი, გვარი, ასაკი, სიმაღლე, წონა და ამ მონაცემების გამოყენებით დაბეჭდეთ ერთი დიდი წინადადება.

#---------------------------------------------------------------------------------------------------------

# 2)
   # input - ნიშნავს მონაცემების შეტანას პროგრამაში.მაგალითად კლავიატურა,მაუსი,მიკროფონი და სხვა.
   # output - ნიშნავს პროგრამის მიერ მიღებული შედეგის ჩვენებას.მაგალითად მონიტორი,პრინტერი,პროექტორი და სხვა.

#-----------------------------------------------------------------------------------------------------------

# 3) 
num_1 = input("დაწერე რამე: ")
print(type(num_1))

#--------------------------------------------------------------------------------------------------------------

# 4)
first = "Goa"
second = "aleqsandre"
third = 7
forth = 9.08
fifth = "99"
#first,second,fift (str) - ინახავს სტრინგს
#third (int) - ინახავს ინტეჯერ
#fourth (float) - ინახავს ფლოატს

#--------------------------------------------------------------------------------------------------------------

# 5)
num1 = "boy"
num2 = 78
num3 = 0.9
print(type(num1))
print(type(num2))
print(type(num3))

#----------------------------------------------------------------------------------------------------------------

# 6)
one = input("შემოტანეთ პირველი სიტყვა: ")
two = input("შემოტანეთ მეორე სიტყვა: ")
print(one + two)

#----------------------------------------------------------------------------------------------------------------

# 7)
number1 = float(input("შემოიტანეთ პირველი რიცხვი: "))
number2 = float(input("შემოიტანეთ მეორე რიცხვი: "))
number3 = float(input("შემოიტანეთ მესამე რიცხვი: "))
number4 = float(input("შემოიტანეთ მეოთხერიცხვი: "))
number5 = float(input("შემოიტანეთ მეხუთე რიცხვი: "))
total = (number1 + number2 + number3 + number4 + number5) // 5
print(total)

#---------------------------------------------------------------------------------------------------------------

# 8)
name = input("enter your name: ")
surname = input("enter your surname: ")
age = input("enter your age: ")
heigh = input("enter your heigh: ") 
weigh = input("enter your weigh: ")
print("my name is " + name + " my surname is " + surname + " i am " + age + " years old " + "i am " + heigh + " cm" + " and i am " + weigh + " kg")

#--------------------------------------------------------------------------------------------------------------