#  / დახრილი ხაზის გაყოფის შედეგის ტიპი ყოველთვის არის float
# print(10 / 2 )

# ---------------------------------------------------------------------

#  // ორი დახრილი ხაზი ამგვრალებს რიცხვს თუ 
#  float გავყოფთ float ზე ან integer ზე პასუხი იქნება float.
#  ხოლო თუ integer გავყოფთ floatზე ან integerზე იქნება integer

#-----------------------------------------------------------------------

# % 
# % გვეხმარება რიცხვის გაყოფის შემდეგ ნაშთის გამოთვლას

#------------------------------------------------------------------------

