# 2) კომენტარების სახით ჩამთვალეთ ყველა შედარებითი ოპერატორები და გააკეთეთ 5-5 ნაგალითი თითოეულზე.

# 3) კომენტარების სახით ახსენით რა არის logical operators, ჩამოწერეთ თითოეული და განმარტეთ რომელი რა დროს რა შედეგს გვიბრუნებს.

# 4) გააკეთეთ 3-3 მაგალითი logical operator-ებზე.

# 5) მომხმარებელს შემოატანინეთ რიცხვი, შეინახეთ იგი ცვლადში და შეადარეთ იგი მეტია თუ არა თქვენს მიერ წინასწარ გამზადებულ რიცხვზე.

# 6) მომხმარებელს შემოატანინეთ სახელი, შეინახეთ იგი ცვლადში და მკაცრად შეამოწმეთ უდრის თუ არა იგი თქვენს სახელს.

# 7) მომხმარებელს შემოატანინეთ თავისი ასაკი, შეინახეთ იგი ცვლადში და შეამოწმეთ მეტია თუ არა იგი 18.


# >, <, ==, !=

#------------------------------------------------------------

# print(6 > 9) 
# print(9 > 8) 
# print(10 > 5) 
# print(8 > 7)
# print(9 > 9)

# print(8 < 10)
# print(9 < 7)
# print(9 < 10) 
# print(7 < 10)
# print(10 < 10)

# print(10 == 10) 
# print(4 == 9)
# print(5 == 5) 
# print(6 == 6)
# print(6 == 9)

# print(99 != 88)
# print(7 != 7)
# print(78 != 77)
# print(9 != 9)
# print(10 != 9)

#---------------------------------------------------------

# logical operators(true/false) გვეხმარება გადავწყვიტოთ: ეს პირობა მართალია თუ არა?

#-----------------------------------------------------

print(False and False)
print(True and False)
print(True and True)
print(True or True)
print(True or False or True or True)
print(False and False and True or False)

#------------------------------------------------------

num_1 = int(input("enter any number: "))
print(10 > num_1)

#---------------------------------------------------------

name = input("enter your name: ")
print("aleqsandre" == name)

#-----------------------------------------------------

age = int(input("enter your age: "))
print(18 > age)
