# 2) შექმენით ცვლადი სადაც შეინახავთ integer ტიპის მონაცემს, შემდეგ შეამოწმეთ თუ ეს რიცხვი რომელიც ცვლადში გაქვთ შენახული მეტია 10 ზე დაპრინტეთ "more than 10" სხვა შემთხვებაში დაპრინტეთ "less than 10"

# 3) მომხმარებელს შემოაყვანინეთ რიცხვი, შემდეგ შეამოწმეთ თუ ეს რიცხვი უდრის 15 ს დაუპრინტეთ "equal to 15" სხვა შემთხვევაში დაუპრინტეთ "not equal to 15"

# 4) მომხმარებელს შემოატანეთ სტრინგი. შენი დავალებაა შეამოწმო, თუ მომხამრებლის მიერ შემოყვანილი სტრინგი არის group92 დაუპრინტეთ 'you are correct" სხვა შემთხვევაში დაუპრინტეთ "you are wrong"

# 5) დაატრიალეთ for ციკლი 50 დან 100 მდე 5 ის გამოტოვებით

# 6) for ციკლის დახმარებით გამოიტანეთ ტერმინალში თქვენი სახელი და გვარი

# 7) while loop ის დახმარებით ტერმინალში გამოიტანეთ რიცხვები 20 დან 50 მდე

# 8) დაბეჭდეთ 0-დან 100-მდე ყველა რიცხვი. (for-თაც და while-თაც)

# 9) დაბეჭდეთ 0-დან 100-ის ჩათვლით ყველა რიცხვი. (for-თაც და while-თაც)

# 10) დაბეჭდეთ 10-დან 20-მდე ყველე რიცხვი (for-თაც და while-თაც)

# 11) დაბეჭდეთ 100-დან 200-ის ჩათვლით ყოველი მე-5 რიცხვი (for-თაც და while-თაც)

# 12) დაბეჭდეთ 10-დან 0-ის ჩათვლით ყველა რიცხვი (for-თაც და while-თაც)

# 13) მომხმარებელს შემოაყვანიეთ რაიმე რიცხვი(მთელი/ათწილადი); შეამოწმეთ ეს რიცხვი - 
# --> თუ დადებითია დაპრინტეთ 'ეს რიცხვი დადებითი რიცხვია'
# --> თუ უარყოფითია დაპრინტეთ 'ეს რიცხვი უარყოფითი რიცხვია'
# --> თუ ნულია დაპრინტეთ 'ეს რიცხვი ნულია'

# 14) მომხმარებელს შემოაყვანიეთ თავისი ასაკი:
# 0–12 წლის ასაკი --> დაპრინტეთ 'ბავშვი ხარ'
# 13-19 წლის ასაკი --> დაპრინტეთ 'მოზარდი/თინეიჯერი ხარ'
# 20-64 წლის ასაკი --> დაპრინტეთ 'ზრდასრული ხართ'
# 65-120 წლის ასაკი --> დაპრინტეთ 'ხანში შესული ხართ'
# 120 და ზემოთ --> დაპრინტეთ 'გურუ ან ჯადოქარი'
# თუ შემოყვანილი ასაკი უარყოფითია --> დაპრინტეთ 'არასწორი ინფო'

# 15) მომხმარებელს შემოატანიეთ სამი რიცხვი(მთელი/ათწილადი) და ამ სამი რიცხვთაგან დაბეჭდეთ უდიდესი

# 16) შემოატანიეთ მომხმარებელს რიცხვი 1-დან 7-ჩათვლით
# თუ 1 --> დაპრინტეთ 'ორშაბათი'
# თუ 2 --> დაპრინტეთ 'სამშაბათი'
# თუ 3 --> დაპრინტეთ 'ოთხშაბათი'
# თუ 4 --> დაპრინტეთ 'ხუთშაბათი'
# თუ 5 --> დაპრინტეთ 'პარასკევი' 
# თუ 6 --> დაპრინტეთ 'შაბათი'
# თუ 7 --> დაპრინტეთ 'კვირა' 
# სხვა დანარჩენი --> 'არ ვიცი ეგ რა დღეა'

# 17) მომხმარებელს შემოატანინეთ რიცხვი, თუ ის მეტია 50-ზე დაბეჭდეთ ეს რიცხვი გამრავლებული 5-ზე, სხვა შემთხვევაში დაბეჭდეთ ეს რიცხვი კვადრატში.

# 18) მომხმარებელს შემოატანინეთ პაროლი თუ ის უდრის მაგალითად "goa123"-ს დაბეჭდეთ "Password is correct!", სხვა შემთხვევაში დაბეჭდეთ "Incorrect password!"

# 19) მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ 1-დან შემოტანილის ჩათვლით ყველა რიცხვის ჯამი.

#--------------------------------------------------------------------------------------------------------------------------------------------------------------

# 2)
num = 15

if num > 10:
    print("more than 10")
else:
    print("less than 10")


# 3)
number = int(input("Enter number: "))

if number == 15:
    print("equal to 15")
else:
    print("not equal to 15")


# 4)
text = input("Enter something: ")

if text == "group92":
    print("you are correct")
else:
    print("you are wrong")


# 5)
for i in range(50, 101, 5):
    print(i)


# 6)
for i in range(1,10):
    print("aleqsandre mefarishvili")


# 7)
i = 20

while i <= 50:
    print(i)
    i += 1


# 8) 
for i in range(0, 101):
    print(i)


i = 0

while i <= 100:
    print(i)
    i += 1


# 9) 
for i in range(0, 101):
    print(i)


i = 0

while i <= 100:
    print(i)
    i += 1


# 10) 
for i in range(10, 21):
    print(i)


i = 10

while i <= 20:
    print(i)
    i += 1


# 11) 
for i in range(100, 201, 5):
    print(i)


i = 100

while i <= 200:
    print(i)
    i += 5


# 12) 
for i in range(10, -1, -1):
    print(i)


i = 10

while i >= 0:
    print(i)
    i -= 1


# 13)
number = float(input("Enter number: "))

if number > 0:
    print("ეს რიცხვი დადებითი რიცხვია")
elif number < 0:
    print("ეს რიცხვი უარყოფითი რიცხვია")
else:
    print("ეს რიცხვი ნულია")


# 14)
age = int(input("Enter age: "))


if age <= 12:
    print("ბავშვი ხარ")
elif age <= 19:
    print("მოზარდი/თინეიჯერი ხარ")
elif age <= 64:
    print("ზრდასრული ხართ")
elif age <= 120:
    print("ხანში შესული ხართ")
elif age > 120:
    print("გურუ ან ჯადოქარი")
else:
    print("არასწორი ინფო")


# 15)
num1 = float(input("Enter first number: "))
num2 = float(input("Enter second number: "))
num3 = float(input("Enter third number: "))

if num1 >= num2 and num1 >= num3:
    print("უდიდესი რიცხვია:", num1)
elif num2 >= num1 and num2 >= num3:
    print("უდიდესი რიცხვია:", num2)
else:
    print("უდიდესი რიცხვია:", num3)

# 16)
day = int(input("შეიყვანეთ რიცხვი 1-დან 7-მდე: "))

if day == 1:
    print("ორშაბათი")
elif day == 2:
    print("სამშაბათი")
elif day == 3:
    print("ოთხშაბათი")
elif day == 4:
    print("ხუთშაბათი")
elif day == 5:
    print("პარასკევი")
elif day == 6:
    print("შაბათი")
elif day == 7:
    print("კვირა")
else:
    print("არ ვიცი ეგ რა დღეა")


# 17)
number = int(input("შეიყვანეთ რიცხვი: "))

if number > 50:
    print(number * 5)
else:
    print(number * 2)


# 18)
password = input("შეიყვანეთ პაროლი: ")

if password == "goa123":
    print("Password is correct!")
else:
    print("Incorrect password!")


# 19)
number = int(input("შეიყვანეთ რიცხვი: "))

sum = 0

for i in range(1, number + 1):
    sum += i

print("ჯამი არის:", sum)