# 2) მომხმარებელს შემოაყვანინე სამი რიცხვი, ხოლო პროგრამამ დაბეჭდოს მათი საშუალო არითმეტიკული.

# 3) მომხმარებელს შემოატანინე ორი რიცხვი და დაბეჭდე მათი ჯამი.

# 4) input ფუნქციის საშუალებით შემოიყვანეთ თქვენი და თქვენი ოჯახის წევრების სახელები და დაპრინტეთ ერთი დიდი წინადადება კონკატენაციის სახით.

# 5) მომხმარებელს შემოატანინეთ მისი ქალაქის, უბნის, კორპუსის და სართულის შესახებ ინფორმაცია (რომლებიც უნდა შეინახოთ ცალ-ცალკე ცვლადებში). მაგ. city = "Tbilisi", District = "{თქვენი უბანი}" და ა.შ. საბოლოოდ print() ბრძანების საშუალებით ტერმინალში გამოიტანეთ მომხმარებლის სრული მისამართი.

# 6) მომხმარებელს შემოატანინეთ ასაკი და ამოყენებითმსგავსი ფორმატის წინადადება: 
# "You are ასაკი years old".

#  2)
num_1 = float(input("შემოიყვანეთ პირველი რიცხვი:  "))
num_2 = float(input("შემოიყვანეთ მეორე რიცხვი:  "))
num_3 = float(input("შემოიყვანეთ მესამე რიცხვი:  "))
total = (num_1 + num_2 + num_3) // 3 
# print( total )

# 3)
num1 = float(input("შემოიყვანეთ ერთი რიცხვი:  "))
num2 = float(input("შემოიყვანეთ მეორე რიცხვი:  "))
average = num1 + num2
# print( average ) 

# 4)
name1 = input("შემოიყვანეთ ოჯახის წევრის სახელი:  ")
name2 = input("შემოიყვანეთ ოჯახის წევრის სახელი:  ")
name3 = input("შემოიყვანეთ ოჯახის წევრის სახელი:  ")
family = (name1 + name2 + name3)
# print(family)

# 5)
city = input("შეიყვანეთ ქალაქი:  ")
district = input("შეიყვანეთ უბანი:  ")
building = input("შეიყვანეთ კორპუსი:  ")
floor = input("შეიყვანეთ სართული:  ")

# print("თქვენი სრული მისამართია:  ")
# print("ქალაქი: ", city)
# print("უბანი: ", district)
# print("კორპუსი: ", building)
# print("სართული: ", floor) 

# 6)
age = input("შემოიყვანე შენი ასაკი:  ")
# print("you " + "are " + age +  " years " + "old")